using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace MyLearn.Data.Migrations
{
    public partial class ArticleSeadDataMig : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Articles",
                columns: new[] { "ArticleId", "ArticeView", "ArticleName", "ArticleText", "ArticleWriter", "CreatedDate" },
                values: new object[,]
                {
                    { 1, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 2, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 3, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 4, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 5, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 6, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 7, 0, "زبان برنامه نویسی سی پلاس پلاس چه کاربرد هایی دارد؟", "ما در این مطلب قصد داریم بیشتر درباره زبان برنامه نویسی سی پلاس پلاس و کاربردهای مختلف آن صحبت کنیم و اطلاعاتی را درباره نرم افزارهایی که با استفاده از این زبان برنامه نویسی پرکاربرد طراحی شده اند به شما ارائه دهیم. زبان برنامه نویسی سی پلاس پلاس یکی از پرکاربردترین زبان های برنامه نویسی در دنیا است که قابلیت های متنوعی را به شما ارائه می دهد. علاوه بر این بسیاری از ابزارهایی که امروزه به صورت روزمره از آنها استفاده می کنیم نیز به همین زبان نوشته شده اند و به همین علت نیز آشنایی با کاربردهای مختلف آن می تواند برای شما مفید و کاربردی باشد. اگر شما هم جزء آن دسته از افرادی هستید که علاقه مند به داشتن اطلاعات بیشتر درباره کاربردهای مختلف زبان سی پلاس پلاس هستید به شما پیشنهاد می کنیم ادامه این مطلب را با دقت مطالعه کنید.", "ایمان مداینی", new DateTime(1, 1, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Articles",
                keyColumn: "ArticleId",
                keyValue: 7);
        }
    }
}
